In [1]:
import numpy as np

In [2]:
import pandas as pd

In [4]:
df = pd.DataFrame(np.random.randn(8, 3),
                      columns=['A', 'B', 'C'])

In [5]:
df.columns = [x.lower() for x in df.columns]

In [6]:
df

          a         b         c
0 -1.403946  1.363505 -0.620712
1 -1.579447 -1.913340  0.485419
2  0.447264  0.917616 -1.119094
3 -1.198066 -0.264946  0.547459
4  0.957132  0.659283 -0.925950
5  0.296987 -1.299058  0.968030
6  1.577398  0.899772 -0.291422
7 -0.407098  0.777311 -0.441570

In [7]:
df.a.array

<PandasArray>
[-1.4039464241843198, -1.5794469985374413,  0.4472641462666437,
 -1.1980662498216035,  0.9571321703313338,  0.2969870969542625,
  1.5773977286169822, -0.4070979282159868]
Length: 8, dtype: float64

In [8]:
data = np.random.randint(0, 7, size=50)

In [9]:
data

array([4, 4, 6, 6, 1, 2, 2, 0, 2, 1, 1, 0, 0, 0, 5, 4, 1, 2, 2, 6, 4, 2,
       1, 3, 4, 0, 4, 0, 6, 0, 6, 1, 2, 0, 4, 0, 3, 3, 5, 5, 3, 2, 3, 3,
       3, 5, 3, 6, 4, 4])

In [10]:
s = pd.Series(data)

In [11]:
s

0     4
1     4
2     6
3     6
4     1
5     2
6     2
7     0
8     2
9     1
10    1
11    0
12    0
13    0
14    5
15    4
16    1
17    2
18    2
19    6
20    4
21    2
22    1
23    3
24    4
25    0
26    4
27    0
28    6
29    0
30    6
31    1
32    2
33    0
34    4
35    0
36    3
37    3
38    5
39    5
40    3
41    2
42    3
43    3
44    3
45    5
46    3
47    6
48    4
49    4
dtype: int64

In [12]:
s.value_counts()

4    9
0    9
3    8
2    8
6    6
1    6
5    4
dtype: int64

In [13]:
s5 = pd.Series([1, 1, 3, 3, 3, 5, 5, 7, 7, 7])

In [14]:
s5.mode()

0    3
1    7
dtype: int64

In [15]:
df5 = pd.DataFrame({"A": np.random.randint(0, 7, size=50),
   .....:                     "B": np.random.randint(-10, 15, size=50)})

In [16]:
df5

    A   B
0   6  -7
1   4  14
2   4  -8
3   6   4
4   5  -1
5   3  -8
6   2   5
7   5  -1
8   6  12
9   4  -7
10  5   1
11  4  14
12  6  14
13  0  13
14  0   7
15  0  13
16  2  -1
17  3  12
18  0   7
19  2   0
20  0   7
21  5  13
22  4  -9
23  2  12
24  6  -4
25  5 -10
26  1   7
27  4   6
28  2  -3
29  2  -6
30  3  11
31  3  11
32  0   6
33  0  -6
34  1  -3
35  6   8
36  2   3
37  2   3
38  0  -2
39  3  -1
40  5  -7
41  0  -8
42  3  -1
43  6  -9
44  4   4
45  3   0
46  0   9
47  6   7
48  3   0
49  0   4

In [17]:
df5.mode()

     A  B
0  0.0 -1
1  NaN  7

In [18]:
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])

In [19]:
s

a    0.872034
b    1.483783
c   -0.143080
d    1.577507
e   -1.632624
dtype: float64

In [20]:
 s.reindex(['e', 'b', 'f', 'd'])

e   -1.632624
b    1.483783
f         NaN
d    1.577507
dtype: float64

In [21]:
df = pd.DataFrame({
     'one': pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
     'two': pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),
     'three': pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})

In [22]:
df

        one       two     three
a  0.583578  3.017069       NaN
b -0.185860  2.030069  1.175376
c -0.872372  1.171101 -1.049624
d       NaN -0.779354 -0.756054

In [23]:
df.reindex(index=['c', 'f', 'b'], columns=['three', 'two', 'one'])

      three       two       one
c -1.049624  1.171101 -0.872372
f       NaN       NaN       NaN
b  1.175376  2.030069 -0.185860

In [24]:
df.reindex(['c', 'f', 'b'], axis='index')

        one       two     three
c -0.872372  1.171101 -1.049624
f       NaN       NaN       NaN
b -0.185860  2.030069  1.175376

In [25]:
df

        one       two     three
a  0.583578  3.017069       NaN
b -0.185860  2.030069  1.175376
c -0.872372  1.171101 -1.049624
d       NaN -0.779354 -0.756054

In [26]:
df.drop(['a', 'd'], axis=0)

        one       two     three
b -0.185860  2.030069  1.175376
c -0.872372  1.171101 -1.049624

In [27]:
df.drop(['one'], axis=1)

        two     three
a  3.017069       NaN
b  2.030069  1.175376
c  1.171101 -1.049624
d -0.779354 -0.756054

In [28]:
s

a    0.872034
b    1.483783
c   -0.143080
d    1.577507
e   -1.632624
dtype: float64

In [29]:
s.rename(str.upper)

A    0.872034
B    1.483783
C   -0.143080
D    1.577507
E   -1.632624
dtype: float64

In [30]:
df

        one       two     three
a  0.583578  3.017069       NaN
b -0.185860  2.030069  1.175376
c -0.872372  1.171101 -1.049624
d       NaN -0.779354 -0.756054

In [31]:
df.rename(columns={'one': 'foo', 'two': 'bar'},
              index={'a': 'apple', 'b': 'banana', 'd': 'durian'})

             foo       bar     three
apple   0.583578  3.017069       NaN
banana -0.185860  2.030069  1.175376
c      -0.872372  1.171101 -1.049624
durian       NaN -0.779354 -0.756054

In [32]:
df

        one       two     three
a  0.583578  3.017069       NaN
b -0.185860  2.030069  1.175376
c -0.872372  1.171101 -1.049624
d       NaN -0.779354 -0.756054

In [33]:
df.rename({'one': 'foo', 'two': 'bar'}, axis='columns')

        foo       bar     three
a  0.583578  3.017069       NaN
b -0.185860  2.030069  1.175376
c -0.872372  1.171101 -1.049624
d       NaN -0.779354 -0.756054

In [34]:
df.rename({'a': 'apple', 'b': 'banana', 'd': 'durian'}, axis='index')

             one       two     three
apple   0.583578  3.017069       NaN
banana -0.185860  2.030069  1.175376
c      -0.872372  1.171101 -1.049624
durian       NaN -0.779354 -0.756054

In [35]:
# datetime

In [36]:
s = pd.Series(pd.date_range('20130101 09:10:12', periods=4))

In [37]:
s

0   2013-01-01 09:10:12
1   2013-01-02 09:10:12
2   2013-01-03 09:10:12
3   2013-01-04 09:10:12
dtype: datetime64[ns]

In [38]:
s.dt.hour

0    9
1    9
2    9
3    9
dtype: int64

In [39]:
s.dt.second

0    12
1    12
2    12
3    12
dtype: int64

In [40]:
s.dt.day

0    1
1    2
2    3
3    4
dtype: int64

In [41]:
s.dt.dayofweek

0    1
1    2
2    3
3    4
dtype: int64

In [42]:
stz = s.dt.tz_localize('US/Eastern')

In [43]:
stz

0   2013-01-01 09:10:12-05:00
1   2013-01-02 09:10:12-05:00
2   2013-01-03 09:10:12-05:00
3   2013-01-04 09:10:12-05:00
dtype: datetime64[ns, US/Eastern]

In [46]:
stz.dt.tz

In [47]:
s.dt.tz_localize('UTC').dt.tz_convert('US/Eastern')

0   2013-01-01 04:10:12-05:00
1   2013-01-02 04:10:12-05:00
2   2013-01-03 04:10:12-05:00
3   2013-01-04 04:10:12-05:00
dtype: datetime64[ns, US/Eastern]

In [48]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'],
                  dtype="string")

In [49]:
 s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5    <NA>
6    caba
7     dog
8     cat
dtype: string

In [50]:
df = pd.DataFrame({
        'one': pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
        'two': pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),
        'three': pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})

In [51]:
df

        one       two     three
a -0.284534  1.032921       NaN
b  1.367838 -0.242519  0.741395
c  1.513154 -1.444897  0.797904
d       NaN -0.491671  0.215234

In [52]:
unsorted_df = df.reindex(index=['a', 'd', 'c', 'b'],
                          columns=['three', 'two', 'one'])

In [53]:
unsorted_df

      three       two       one
a       NaN  1.032921 -0.284534
d  0.215234 -0.491671       NaN
c  0.797904 -1.444897  1.513154
b  0.741395 -0.242519  1.367838

In [54]:
unsorted_df.sort_index()

      three       two       one
a       NaN  1.032921 -0.284534
b  0.741395 -0.242519  1.367838
c  0.797904 -1.444897  1.513154
d  0.215234 -0.491671       NaN

In [55]:
unsorted_df.sort_index(ascending=False)

      three       two       one
d  0.215234 -0.491671       NaN
c  0.797904 -1.444897  1.513154
b  0.741395 -0.242519  1.367838
a       NaN  1.032921 -0.284534

In [56]:
unsorted_df.sort_index(axis=1)

        one     three       two
a -0.284534       NaN  1.032921
d       NaN  0.215234 -0.491671
c  1.513154  0.797904 -1.444897
b  1.367838  0.741395 -0.242519

In [57]:
unsorted_df['three'].sort_index()

a         NaN
b    0.741395
c    0.797904
d    0.215234
Name: three, dtype: float64

In [58]:
df1 = pd.DataFrame({'one': [2, 1, 1, 1],
                        'two': [1, 3, 2, 4],
                        'three': [5, 4, 3, 2]})

In [59]:
df1

   one  two  three
0    2    1      5
1    1    3      4
2    1    2      3
3    1    4      2

In [60]:
df1.sort_values(by='two')

   one  two  three
0    2    1      5
2    1    2      3
1    1    3      4
3    1    4      2

In [61]:
df1[['one', 'two', 'three']].sort_values(by=['one', 'two'])

   one  two  three
2    1    2      3
1    1    3      4
3    1    4      2
0    2    1      5

In [62]:
s

0       A
1       B
2       C
3    Aaba
4    Baca
5    <NA>
6    CABA
7     dog
8     cat
dtype: string

In [63]:
s[2] = np.nan

In [64]:
s.sort_values()

0       A
3    Aaba
1       B
4    Baca
6    CABA
8     cat
7     dog
2    <NA>
5    <NA>
dtype: string

In [65]:
s.sort_values(na_position='first')

2    <NA>
5    <NA>
0       A
3    Aaba
1       B
4    Baca
6    CABA
8     cat
7     dog
dtype: string

In [66]:
idx = pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('a', 2),
                                   ('b', 2), ('b', 1), ('b', 1)])

In [67]:
idx

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 2),
            ('b', 2),
            ('b', 1),
            ('b', 1)],
           )

In [68]:
idx.names = ['first', 'second']

In [69]:
idx

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 2),
            ('b', 2),
            ('b', 1),
            ('b', 1)],
           names=['first', 'second'])

In [70]:
df_multi = pd.DataFrame({'A': np.arange(6, 0, -1)},
                            index=idx)

In [71]:
df_multi

              A
first second
a     1       6
      2       5
      2       4
b     2       3
      1       2
      1       1

In [72]:
df_multi.sort_values(by=['second', 'A'])

              A
first second
b     1       1
      1       2
a     1       6
b     2       3
a     2       4
      2       5